## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # zentral_mdm_blueprint.default will be updated in-place
  ~ resource "zentral_mdm_blueprint" "default" {
      + filevault_config_id             = (known after apply)
        id                              = 1
        name                            = "Default"
      ~ software_update_enforcement_ids = [] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # zentral_mdm_filevault_config.default will be created
  + resource "zentral_mdm_filevault_config" "default" {
      + at_login_only                = true
      + bypass_attempts              = 0
      + destroy_key_on_standby       = true
      + escrow_location_display_name = "PSUMAC24 GitOps Workshop"
      + id                           = (known after apply)
      + name                         = "Default"
      + prk_rotation_interval_days   = 0
      + show_recovery_key            = false
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>